[
  {
    "serviceId": 1,
    "serviceName": "Winter Coat Fitting for Dogs",
    "providerName": "PawCare Studio",
    "providerEmail": "info@pawcare.com",
    "price": 25,
    "rating": 4.9,
    "slotsAvailable": 4,
    "description": "Ensure your furry friend stays cozy, protected, and stylish throughout the harsh winter months with our premium Winter Coat Fitting service. Each outfit is custom-tailored according to your pet’s exact measurements to ensure maximum warmth and comfort. We use windproof, waterproof, and thermal-insulated fabrics that lock in heat while allowing smooth movement during outdoor walks. Our experienced designers also help you select the best coat style based on your dog’s breed, fur thickness, and winter activity levels. Whether it's daily outdoor walks, winter trips, or simply lounging at home, this service guarantees unmatched warmth and style. Give your pet the premium winter comfort they truly deserve.",
    "image": "https://i.ibb.co.com/99QVPTym/images.jpg",
    "category": "Clothing"
  },
  {
    "serviceId": 2,
    "serviceName": "Winter Grooming & Paw Treatment",
    "providerName": "CozyPets Grooming",
    "providerEmail": "hello@cozypets.com",
    "price": 30,
    "rating": 4.8,
    "slotsAvailable": 3,
    "description": "Winter can be harsh on your pet’s skin, coat, and paws. Our Winter Grooming & Paw Treatment service is designed to keep your pet clean, moisturized, and winter-ready. The package includes deep moisturizing fur conditioning, winter-safe shampoo to prevent skin dryness, gentle detangling, and a protective paw balm treatment that shields the paws from snow, ice, and salt. Nail trimming, ear cleaning, and hygiene maintenance are also included. The warm grooming environment ensures your pet remains relaxed throughout the session. This winter-specialized grooming improves coat shine, reduces shedding, and protects paws from cracking or irritation caused by freezing temperatures.",
    "image": "https://i.ibb.co.com/NnT9sqGG/images-1.jpg",
    "category": "Grooming"
  },
  {
    "serviceId": 3,
    "serviceName": "Pet Winter Health Checkup",
    "providerName": "HealthyPaws Clinic",
    "providerEmail": "contact@healthypaws.com",
    "price": 40,
    "rating": 4.7,
    "slotsAvailable": 5,
    "description": "Cold weather increases health risks for pets, especially senior pets, puppies, or those with weak immunity. Our Winter Health Checkup provides a complete winter-readiness evaluation by licensed veterinarians. The session includes coat and skin examination, paw and nail inspection, respiratory check, hydration test, temperature regulation assessment, and energy-level evaluation. We also analyze your pet’s winter diet, suggest immunity-boosting supplements, and provide a personalized winter care routine. If your pet shows signs of winter allergies, joint stiffness, or dry skin, our experts will recommend effective treatments. Protect your pet’s health and keep them strong all season long.",
    "image": "https://i.ibb.co.com/G3vGTKvc/images-2.jpg",
    "category": "Health"
  },
  {
    "serviceId": 4,
    "serviceName": "Heated Pet Bed Setup",
    "providerName": "WarmPets Co.",
    "providerEmail": "support@warmpets.com",
    "price": 35,
    "rating": 4.6,
    "slotsAvailable": 6,
    "description": "Give your pet a warm, peaceful place to sleep during freezing nights with our Heated Pet Bed Setup service. We provide safe, low-voltage heated mats, insulated blankets, and soft winter bedding. All materials are tested for overheating protection and energy efficiency. The setup is customized according to your home’s layout and your pet’s sleeping habits. For older pets or pets with arthritis, this heated bedding helps reduce joint stiffness and improves sleep quality. Your furry companion will enjoy a warm, cozy, and restful winter sleeping environment.",
    "image": "https://i.ibb.co.com/NnJdTnhM/images-3.jpg",
    "category": "Comfort"
  },
  {
    "serviceId": 5,
    "serviceName": "Winter Hydration Therapy",
    "providerName": "PetHydrate Solutions",
    "providerEmail": "info@pethydrate.com",
    "price": 20,
    "rating": 4.5,
    "slotsAvailable": 4,
    "description": "Pets tend to drink less water during winter, which may lead to dehydration, dry skin, low energy, and kidney strain. Our Winter Hydration Therapy ensures your pet stays properly hydrated using warm, nutrient-rich broths, hydration boosters, and immunity-supporting natural supplements. The therapy helps maintain fluid balance, reduces winter fatigue, and improves coat texture. Suitable for pets of all ages—especially those who dislike cold water or suffer from seasonal dryness. Keep your pets refreshed, energetic, and healthy throughout winter.",
    "image": "https://i.ibb.co.com/CKcNGNTt/a640ac20-bd34-11ef-bf47-953e7325b283.jpg",
    "category": "Health"
  },
  {
    "serviceId": 6,
    "serviceName": "Anti-Slip Paw Wax Treatment",
    "providerName": "SafePaws Grooming",
    "providerEmail": "hello@safepaws.com",
    "price": 15,
    "rating": 4.8,
    "slotsAvailable": 7,
    "description": "Your pet’s paws are extremely vulnerable during winter due to snow, ice, and rough surfaces. Our Anti-Slip Paw Wax Treatment forms a soft yet protective barrier that prevents cracking, dryness, and irritation. The natural wax formula improves grip, reduces slipping risk, and keeps paws moisturized for hours. Perfect for pets that walk on icy roads, tiles, or snowy surfaces. The treatment is fully pet-safe, non-toxic, and lick-friendly. Keep your furry friend safe, confident, and comfortable this winter.",
    "image": "https://i.ibb.co.com/ks34bc8M/images-4.jpg",
    "category": "Grooming"
  },
  {
    "serviceId": 7,
    "serviceName": "Winter Pet Photography Session",
    "providerName": "FurFrame Studio",
    "providerEmail": "studio@furframe.com",
    "price": 50,
    "rating": 4.9,
    "slotsAvailable": 3,
    "description": "Capture your pet’s cutest winter moments with our professional Winter Pet Photography package. Includes winter-themed backdrops, cozy outfits, soft natural lighting, snow-like effects, and high-quality edited photos.",
    "image": "https://i.ibb.co.com/HpnYF7wP/photography.jpg",
    "category": "Photography"
  },
  {
    "serviceId": 8,
    "serviceName": "Pet Winter Diet Plan",
    "providerName": "NutriPet Care",
    "providerEmail": "care@nutripet.com",
    "price": 28,
    "rating": 4.7,
    "slotsAvailable": 5,
    "description": "A fully customized winter nutrition plan for your pet including warm meals, protein boosters, hydration support, and immunity-improving supplements. Diet is tailored according to breed, weight, age, and winter activity.",
    "image": "https://i.ibb.co.com/PZDTpzHR/diet.webp",
    "category": "Nutrition"
  },
  {
    "serviceId": 9,
    "serviceName": "Thermal Jacket Custom Design",
    "providerName": "PetFashion Hub",
    "providerEmail": "design@petfashion.com",
    "price": 45,
    "rating": 4.9,
    "slotsAvailable": 2,
    "description": "Handcrafted thermal jackets made with high-density insulation, waterproof exterior, fur lining, and stylish patterns. Each jacket is designed based on your pet’s measurements and winter needs.",
    "image": "https://i.ibb.co.com/hRLbb3rN/design.jpg",
    "category": "Clothing"
  },
  {
    "serviceId": 10,
    "serviceName": "Winter Exercise & Indoor Training",
    "providerName": "FitPaws Academy",
    "providerEmail": "trainer@fitpaws.com",
    "price": 22,
    "rating": 4.6,
    "slotsAvailable": 8,
    "description": "Helps pets stay active during winter through indoor obstacle courses, warm-up exercises, agility training, and personalized winter fitness routines. Prevents winter laziness and weight gain.",
    "image": "https://i.ibb.co.com/NgTq3XpK/traning.jpg",
    "category": "Training"
  },
  {
    "serviceId": 11,
    "serviceName": "Winter Allergy Care & Treatment",
    "providerName": "SnowShield VetCare",
    "providerEmail": "support@snowshield.com",
    "price": 33,
    "rating": 4.8,
    "slotsAvailable": 4,
    "description": "Winter can trigger skin allergies, sneezing, itching, and coat dryness in sensitive pets. This package includes allergy diagnosis, skin hydration therapy, winter-safe anti-allergen sprays, and customized treatment plans.",
    "image": "https://i.ibb.co.com/R46fh2zV/exercise.jpg",
    "category": "Health"
  },
  {
    "serviceId": 12,
    "serviceName": "Winter Vitamin & Nutrition Pack",
    "providerName": "NutriPets",
    "providerEmail": "contact@nutripets.com",
    "price": 50,
    "rating": 4.9,
    "slotsAvailable": 5,
    "description": "Special vitamin packs to boost immunity and energy for pets during cold months.",
    "image": "https://i.ibb.co.com/SX4z13Dm/vitamin.webp",
    "category": "Nutrition"
  }
]